{
  "Entrance Hall": "A grand entrance with marble floors and dusty paintings on the walls.",
  "Grand Library": "Towering shelves filled with ancient tomes reach toward the vaulted ceiling.",
  "Kitchen": "An old kitchen with rusty pots hanging above a cold, ash-filled fireplace.",
  "Master Bedroom": "A luxurious bedroom with a canopy bed and an ornate broken mirror.",
  "Wine Cellar": "A damp cellar lined with wine racks, cobwebs covering dusty bottles.",
  "Garden": "An overgrown garden where wilted flowers surround a crumbling fountain.",
  "Dusty Attic": "A cramped attic filled with old trunks, forgotten furniture, and thick dust.",
  "Study": "A scholar's study featuring a large oak desk covered in scattered papers.",
  "Portrait Gallery": "A long gallery where faded portraits seem to watch your every move.",
  "Vault": "A secure vault with thick metal walls and a heavy reinforced door.",
  "Ballroom": "An elegant ballroom with a crystal chandelier and polished marble floor.",
  "Conservatory": "A glass-walled room filled with exotic dead plants and broken pots.",
  "Dining Hall": "A vast dining hall with a long table set for a feast that never came.",
  "Servant Quarters": "Small, cramped quarters with simple beds and personal belongings.",
  "Tower Room": "A circular room at the top of a tower with windows facing all directions.",
  "Chapel": "A small chapel with wooden pews and stained glass windows casting colored light.",
  "Armory": "Walls lined with ancient weapons and suits of armor standing at attention.",
  "Trophy Room": "Mounted heads and hunting trophies adorn every available surface.",
  "Music Room": "A room with a grand piano, harps, and various musical instruments.",
  "Observatory": "A domed room with a large telescope pointing toward the stars.",
  "Dungeon": "A dark, dank dungeon with iron bars and chains hanging from the walls.",
  "Secret Passage": "A narrow hidden corridor with stone walls and a musty smell.",
  "Throne Room": "A majestic throne room with a golden throne on a raised platform.",
  "Alchemy Lab": "Strange equipment, bubbling flasks, and mystical symbols cover the benches.",
  "Treasure Room": "Glittering piles of gold coins and jewels fill this locked chamber.",
  "Crypt": "Ancient stone sarcophagi line the walls of this underground burial chamber.",
  "Underground Cave": "A natural cave with stalactites dripping water and bioluminescent moss.",
  "Clock Tower": "Giant gears and mechanisms surround you, ticking rhythmically.",
  "Great Hall": "An enormous hall with high ceilings and faded banners hanging from the walls.",
  "Royal Chambers": "Opulent chambers decorated with gold trim and purple velvet.",
  "Smithy": "A workshop with an anvil, forge, and various metalworking tools.",
  "Stables": "Empty stalls that once housed horses, with hay scattered on the ground.",
  "Courtyard": "An open-air courtyard with a dried-up fountain and overgrown plants.",
  "Meditation Chamber": "A peaceful room with cushions, incense holders, and calming symbols.",
  "War Room": "A strategic planning room with maps, flags, and miniature battlefield models.",
  "Archive": "Endless shelves of documents, scrolls, and historical records fill this room.",
  "Scriptorium": "Desks with quills, ink, and half-finished manuscripts cover the workspace.",
  "Torture Chamber": "A grim room with sinister devices and dark stains on the floor.",
  "Training Grounds": "An indoor space with practice dummies, targets, and training equipment.",
  "Barracks": "Rows of simple beds where soldiers once slept between battles.",
  "Lighthouse": "A tall tower room with a massive lamp and windows overlooking the sea.",
  "Boathouse": "A water-level room with docks and boats bobbing in dark water.",
  "Watchtower": "A defensive position with arrow slits and a commanding view.",
  "Bridge": "A covered bridge connecting two sections of the structure.",
  "Gatehouse": "A fortified entrance with murder holes and a portcullis mechanism.",
  "Temple": "A sacred space with an altar, offerings, and religious iconography.",
  "Shrine": "A small devotional space dedicated to a forgotten deity.",
  "Sanctuary": "A protected holy space with pews and devotional candles.",
  "Cathedral": "A grand religious space with soaring architecture and colored glass.",
  "Monastery": "A quiet contemplative space with simple furnishings and scriptures.",
  "Laboratory": "Scientific equipment, beakers, and research notes fill this room.",
  "Workshop": "A craftsman's workspace with tools, materials, and half-finished projects.",
  "Storage Room": "Shelves and crates packed with various supplies and equipment.",
  "Pantry": "A food storage room with shelves of preserved goods and dried herbs.",
  "Laundry": "Large wash basins, drying racks, and piles of old linens.",
  "Bath House": "A luxurious bathing area with a large tub and expensive soaps.",
  "Spa": "A relaxation room with massage tables and aromatic oils.",
  "Sauna": "A wooden room with benches and a cold stone heating pit.",
  "Pool Room": "An indoor pool with murky water and decorative tiles.",
  "Gymnasium": "An exercise space with weights, equipment, and training apparatus."
}
